
//자동완성 가능!
alert("js파일 시작합니다.")
/* 1.변수/상수/배열 사전적 정의
변수 :변수(variable)란 데이터(data)를 저장하기 위해 프로그램에 의해 이름을 할당받은 메모리 공간을 의미합니다.

즉, 변수란 데이터(data)를 저장할 수 있는 메모리 공간을 의미하며, 이렇게 저장된 값은 변경될 수 있습니다.

상수 : 변하지 않는 수, 항상 성립하는 수라는 뜻이다. 반대말은 변수이다.

배열 : 컴퓨터 과학에서 배열은 번호와 번호에 대응하는 데이터들로 이루어진 자료 구조를 나타낸다. 
일반적으로 배열에는 같은 종류의 데이터들이 순차적으로 저장되어, 값의 번호가 곧 배열의 시작점으로부터 값이 저장되어 있는 상대적인 위치가 된다. 
대부분의 프로그래밍 언어에서 사용할 수 있는 가장 기초적인 자료 구조로, 기본적인 용도 외에 다른 복잡한 자료 구조들을 표현하기 위해서 또는 행렬, 벡터 등을 컴퓨터에서 표현하는 용도 등으로도 사용된다.
 */ 			

/*
	2.생활속 예시
	변수:머리카락=머리카락길이 , 손톱 = 손톱길이
	상수: 성별 ='남자' , '여자'
	배열: 사람[남자,여자,머리카락,손톱]
 */
/*
let 머리카락=prompt('머리카락 길이:')	//변수
console.log('머리카락:'+ 머리카락)	//변수출력
const 성별=prompt('성별을 입력하시오(남자,여자):')	//상수
console.log('성별 :'+ 성별)					//상수출력
let 사람=['머리카락', '손톱', '남자' , '여자' , '심장']	//배열
console.log(사람)									//배열출력
*/

 			